app/controllers/earthquakes_controller.rb

  def index
    @earthquakes = Earthquake.all
---
SELECT "earthquakes".* FROM "earthquakes"

  def create
    @earthquake = Earthquake.new(earthquake_params)

    respond_to do |format|
      if @earthquake.save
---
INSERT INTO "earthquakes" ("usgs_id", "tsunami", "year", "month", "day", "hour", "minute", "second", "focal_depth", "eq_primary", "eq_mag_mw", "eq_mag_ms", "eq_mag_mb", "eq_mag_ml", "eq_mag_mfa", "eq_mag_unk", "intensity", "country", "state", "location", "latitude", "longitude", "region_code", "houses_damaged", "houses_damaged_description", "total_houses_damaged", "total_houses_damaged_description", "death_count", "death_description", "missing_count", "missing_description", "injury_count", "injury_description", "damage_cost", "damage_description", "houses_destroyed", "houses_destroyed_description", "total_deaths", "total_deaths_description", "total_missing", "total_missing_description", "total_injuries", "total_injuries_description", "total_damage_cost", "total_damage_description", "total_houses_destroyed", "total_houses_destroyed_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49) RETURNING "id"

  def destroy
    @earthquake.destroy
---
DELETE FROM "earthquakes" WHERE "earthquakes"."id" = $1  [["id", 980190962]]

    def set_earthquake
      @earthquake = Earthquake.find(params[:id])
---
SELECT  "earthquakes".* FROM "earthquakes" WHERE "earthquakes"."id" = $1 LIMIT 1  [["id", 980190962]]