app/controllers/eruptions_controller.rb

SELECT "eruptions".* FROM "eruptions"
---
  def index
    @eruptions = Eruption.all

INSERT INTO "eruptions" ("year", "month", "day", "tsunami", "earthquake", "name", "location", "country", "latitude", "longitude", "elevation", "eruption_type", "status", "time", "vei", "agent", "death_count", "death_description", "missing_count", "missing_description", "injury_count", "injury_description", "damage_cost", "damage_description", "houses_destroyed", "houses_destroyed_description", "total_deaths", "total_deaths_description", "total_missing", "total_missing_description", "total_injuries", "total_injuries_description", "total_damage_cost", "total_damage_description", "total_houses_destroyed", "total_houses_destroyed_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38) RETURNING "id"
---
  def create
    @eruption = Eruption.new(eruption_params)

    respond_to do |format|
      if @eruption.save

DELETE FROM "eruptions" WHERE "eruptions"."id" = $1  [["id", 980190962]]
---
  def destroy
    @eruption.destroy

SELECT  "eruptions".* FROM "eruptions" WHERE "eruptions"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_eruption
      @eruption = Eruption.find(params[:id])